import java.util.*;

/**
 * Αποθηκεύει όλες τις ερωτήσεις του παιχνιδιού, χωρισμένες ανά επίπεδο.
 * Παρέχει τυχαία ερώτηση για κάθε επίπεδο.
 * @author Sidiraki Eleni Msc in Applied Informatics 2025
 */

public class QuestionBank {
    private List<Question> easyQuestions = new ArrayList<>();
    private List<Question> mediumQuestions = new ArrayList<>();
    private List<Question> hardQuestions = new ArrayList<>();

    public QuestionBank() {
        loadEasyQuestions();
        loadMediumQuestions();
        loadHardQuestions();
    }

    private void loadEasyQuestions() {
        easyQuestions.add(new Question(
            "Ποιο είναι το εθνικό φαγητό της Ιταλίας;",
            new String[] {"Sushi", "Pizza", "Taco", "Curry"},
            1,
            "Ξεκινάει με Π και ταιριάζει με μαργαρίτα!"
        ));
        easyQuestions.add(new Question(
            "Ποιο είναι το μεγαλύτερο νησί της Ελλάδας;",
            new String[]{"Ρόδος", "Κρήτη", "Εύβοια", "Λέσβος"}, 
            1,
            "Έχει τα Λευκά Όρη και τον Ψηλορείτη"));
        easyQuestions.add(new Question(
            "Πόσες ήπειροι υπάρχουν στον κόσμο;", 
            new String[]{"4", "5", "6", "7"}, 
            3, 
            "Ξεκινάμε από Ευρώπη και μετράμε \nμέχρι Αυστραλία"));
        easyQuestions.add(new Question(
            "Ποιο είναι το αρχαίο ελληνικό σύμβολο της σοφίας;",
             new String[]{"Λύκος", "Κουκουβάγια", "Δελφίνι", "Λιοντάρι"},
             1, 
             "Ανήκει και στη θεά Αθηνά"));
        easyQuestions.add(new Question(
            "Ποιο άθλημα παίζεται με ρακέτα και μπαλάκι σε\nτραπέζι;",
            new String[]{"Τένις", "Μπάντμιντον", "Πινγκ Πονγκ", "Γκολφ"},
            2, 
            "Το τραπέζι είναι ολόκληρο το γήπεδο"));
        easyQuestions.add(new Question(
            "Τι είναι το Άουσβιτς;", 
            new String[]{"Μουσείο", "Κάστρο", "Στρατόπεδο συγκέντρωσης", "Εργοστάσιο"},
            2,
            "Β’ Παγκόσμιος Πόλεμος, Εβραίοι"));
        easyQuestions.add(new Question(
            "Ποιο είναι το σύμβολο του σιδήρου στον περιοδικό\nπίνακα;", 
            new String[]{"Ir", "Si", "Fe", "Sn"},
            2, 
            "Από τη λατινική λέξη 'ferrum'"));
        easyQuestions.add(new Question(
            "Ποιος ήταν ο πρώτος άνθρωπος που πάτησε στο\nφεγγάρι;", 
            new String[]{"Γιούρι Γκαγκάριν", "Νηλ Άρμστρονγκ", "Έντουιν Όλντριν", "Αλμπερτ Αϊνστάιν"},
            1,
            "Το είπε: “One small step…”"));
        easyQuestions.add(new Question(
            "Τι είναι ο Μπετόβεν;", 
            new String[]{"Ζωγράφος", "Συγγραφέας", "Μαέστρος", "Φιλόσοφος"},
            2,
            "Έγραψε 9 συμφωνίες"));
        easyQuestions.add(new Question(
            "Ποιο είναι το νόμισμα της Ιαπωνίας;", 
            new String[]{"Γουόν", "Γιουάν", "Γεν", "Μπατ"},
            2, 
            "Ξεκινάει με «Γ»"));
        easyQuestions.add(new Question(
            "Ποια είναι η έδρα του ΟΗΕ;", 
            new String[]{"Γενεύη", "Παρίσι", "Νέα Υόρκη", "Βρυξέλλες"},
            2, 
            "ΗΠΑ"));
        easyQuestions.add(new Question(
            "Ποιο από τα παρακάτω είναι πλανήτης;", 
            new String[]{"Ήλιος", "Σελήνη", "Άρης", "Αστέρι του Βορρά"},
            2,
            "Ονομάστηκε από θεό του πολέμου"));
        easyQuestions.add(new Question(
            "Σε ποια ήπειρο βρίσκεται η Αίγυπτος;", 
            new String[]{"Ασία", "Ευρώπη", "Αφρική", "Αμερική"},
            2, 
            "Ο Νείλος ρέει εκεί"));
        easyQuestions.add(new Question(
            "Ποια είναι η πρωτεύουσα της Πορτογαλίας;",
            new String[]{"Μαδρίτη", "Λισαβόνα", "Ρώμη", "Βαρκελώνη"}, 
            1,
            "Πόλη στην Ιβηρική χερσόνησο"));
        easyQuestions.add(new Question(
            "Ποια είναι η μονάδα μέτρησης της \nθερμοκρασίας στο SI;",
            new String[]{"Κέλβιν", "Κελσίου", "Φαρενάιτ", "Βαθμοί"}, 
            0, 
            "Χωρίς αρνητικές τιμές"));
        easyQuestions.add(new Question(
            "Ποια είναι η ελληνική λέξη για το 'democracy';", 
            new String[]{"Δημαρχία", "Λαοκρατία", "Δημοκρατία", "Πολιτεία"},
            2, 
            "Από το 'δήμος' και 'κράτος'"));
        easyQuestions.add(new Question(
            "Ποια λέξη σχετίζεται περισσότερο με την\n πληροφορική;",
            new String[]{"Πρωτόκολλο", "Πρωτότυπο", "Πρότυπο", "Προοίμιο"},
            0,
            "Απαραίτητο για επικοινωνία δικτύων"));
        easyQuestions.add(new Question(
            "Ποιο από τα παρακάτω είναι έργο του Πυθαγόρα;",
            new String[]{"Ευκλείδεια γεωμετρία", "Αξίωμα του Αρχιμήδη", "Θεώρημα της \nυποτείνουσας", "Κανόνας του Θαλή"},
            2, 
            "a² + b² = c²"));
        easyQuestions.add(new Question(
            "Ποια είναι η βασική γλώσσα προγραμματισμού στο\n Web;",
            new String[]{"Java", "Python", "HTML", "C++"},
            2, 
            "Είναι markup, όχι πραγματική γλώσσα προγραμματισμού"));
        easyQuestions.add(new Question(
            "Πόσα χρώματα έχει η ελληνική σημαία;",
            new String[]{"1", "2", "3", "4"}, 
            1,
            "Λευκό και μπλε"));
        easyQuestions.add(new Question(
            "Ποιο είναι το αντίθετο του 'ψηλός';", 
            new String[]{"Κοντός", "Μικρός", "Λεπτός", "Χαμηλός"}, 
            0,
            "Αναφέρεται σε ύψος ανθρώπου"));

    }

    private void loadMediumQuestions() {
        mediumQuestions.add(new Question(
            "Ποια χρονιά έγινε η Ελληνική Επανάσταση;",
            new String[] {"1821", "1921", "1700", "2001"},
            0,
            "Είναι η χρονιά που λέμε στα κάλαντα του Μάρτη!"
        ));
        mediumQuestions.add(new Question(
            "Ποια ήταν η αιτία του Ψυχρού Πολέμου;",
            new String[]{"Αποικιοκρατία", "Θρησκεία", "Ιδεολογικές διαφορές", "Οικολογία"}, 
            2, 
            "Καπιταλισμός VS Κομμουνισμός"));
        mediumQuestions.add(new Question(
            "Πόσες πλευρές έχει ένα κανονικό οκτάγωνο;",
            new String[]{"6", "7", "8", "9"},
            2, 
            "Όπως το stop σήμα 🚫"));
        mediumQuestions.add(new Question(
            "Ποια είναι η πρωτεύουσα της Ελβετίας;", 
            new String[]{"Γενεύη", "Ζυρίχη", "Βέρνη", "Λουκέρνη"}, 
            2,
            "Δεν είναι η μεγαλύτερη σε πληθυσμό"));
        mediumQuestions.add(new Question(
            "Πώς ονομάζεται η διαδικασία με την οποία τα φυτά \n παράγουν τροφή από το φως;", 
            new String[]{"Αναπνοή", "Φωτοσύνθεση", "Καύση", "Ζύμωση"}, 
            1, "Περιλαμβάνει χλωροφύλλη"));
        mediumQuestions.add(new Question(
            "Ποιος έγραψε το \"Έγκλημα και Τιμωρία\";", 
            new String[]{"Ντοστογιέφσκι", "Τολστόι", "Καμί", "Κάφκα"},
            0, "Ρώσος συγγραφέας του 19ου αιώνα"));
        mediumQuestions.add(new Question(
            "Ποιο στοιχείο έχει το σύμβολο 'Na';", 
            new String[]{"Νάτριο", "Νικέλιο", "Νοβίλιο", "Νιόβιο"},
            0, 
            "Είναι άλας!"));
        mediumQuestions.add(new Question(
            "Ποια χώρα έχει τον ψηλότερο καταρράκτη στον κόσμο;",
            new String[]{"ΗΠΑ", "Νορβηγία", "Βενεζουέλα", "Καναδάς"},
            2,  
            "Καταρράκτης Άνχελ"));
        mediumQuestions.add(new Question(
            "Ποιος πίνακας ζωγραφίστηκε από τον Λεονάρντο ντα\nΒίντσι;", 
            new String[]{"Η Κραυγή", "Το Φιλί", "Μόνα Λίζα", "Η Γκουέρνικα"}, 
            2,
            "Διάσημο χαμόγελο"));
        mediumQuestions.add(new Question(
            "Ποιος ήταν ο πρώτος πρόεδρος της Δημοκρατίας στην Ελλάδα \nμετά τη μεταπολίτευση;", 
            new String[]{"Κωνσταντίνος Τσάτσος", "Αλέξανδρος Ζαΐμης", "Κάρολος Παπούλιας", "Σαρτζετάκης"},
            0, 
            "Δικηγόρος και ακαδημαϊκός"));
        mediumQuestions.add(new Question(
            "Ποια χώρα έχει την υψηλότερη πυκνότητα πληθυσμού;", 
            new String[]{"Μπαγκλαντές", "Ολλανδία", "Ινδία", "Μονακό"},
            3, 
            "Πολύ μικρή, πολύ γεμάτη"));
        mediumQuestions.add(new Question(
            "Πόσοι χρόνοι υπάρχουν στη Νέα Ελληνική Γλώσσα;", 
            new String[]{"3", "4", "5", "6"}, 3, 
            "Παρακείμενος, Υπερσυντέλικος, κ.λπ."));
        mediumQuestions.add(new Question(
            "Ποιος ανακάλυψε τη γενική θεωρία της σχετικότητας;",
            new String[]{"Νεύτωνας", "Αϊνστάιν", "Πλανκ", "Μάξγουελ"}, 
            1,
            "E=mc²"));
        mediumQuestions.add(new Question(
            "Ποια είναι η μικρότερη ήπειρος;", 
            new String[]{"Ασία", "Αφρική", "Ανταρκτική", "Ωκεανία"},
            3, 
            "Εκεί είναι η Αυστραλία"));
        mediumQuestions.add(new Question(
            "Ποιος ήταν ο Σόλωνας στην αρχαία Αθήνα;", 
            new String[]{"Βασιλιάς", "Νομοθέτης", "Στρατηγός", "Φιλόσοφος"},
            1,
            "Καθιέρωσε τη σεισάχθεια"));
        mediumQuestions.add(new Question(
            "Πόσοι δορυφόροι έχει ο Άρης;", 
            new String[]{"0", "1", "2", "4"}, 
            2, 
            "Φόβος και Τρόμος (Φόβος & Δείμος)"));
        mediumQuestions.add(new Question(
            "Τι είναι το 'Gutenberg' στην ιστορία της\nτεχνολογίας;", 
            new String[]{"Πρώτη βιβλιοθήκη", "Πρώτο ρομπότ", "Πρώτη τυπογραφική μηχανή", "Πρώτο βιβλίο"},
            2, 
            "Εκτύπωσε τη Βίβλο"));
        mediumQuestions.add(new Question(
            "Ποιο είναι το χημικό σύμβολο του ασβεστίου;",
            new String[]{"As", "Ca", "Al", "Cs"}, 
            1,
            "Χτίζει τα κόκκαλα")); 
        mediumQuestions.add(new Question(
            "Ποια χώρα είναι γνωστή για τη φιλοσοφία των\nσαμουράι;", 
            new String[]{"Κίνα", "Νότια Κορέα", "Ιαπωνία", "Ταϊβάν"}, 
            2, 
            "Κώδικας Μπουςίντο"));
        mediumQuestions.add(new Question(
            "Ποια επιστήμη ασχολείται με τους χάρτες;", 
            new String[]{"Τοπογραφία", "Γεωλογία", "Γεωγραφία", "Χαρτογραφία"}, 
            3, "Από τη λέξη 'χάρτης'"));
        mediumQuestions.add(new Question(
            "Πόσες χορδές έχει μια κλασική κιθάρα;",
            new String[]{"4", "5", "6", "7"}, 
            2,
            "Έχει και μπασογραμμές και μελωδία"));


    }

    private void loadHardQuestions() {
        hardQuestions.add(new Question(
            "Ποιο είναι το χημικό σύμβολο του χρυσού;",
            new String[] {"Ag", "Au", "Hg", "Pt"},
            1,
            "Ξεκινάει όπως το 'Aurum'"
        ));
        hardQuestions.add(new Question(
            "Ποιο είναι το μικρότερο σωματίδιο ενός στοιχείου \nπου διατηρεί τις ιδιότητές του;", 
            new String[]{"Μόριο", "Άτομο", "Πρωτόνιο", "Ηλεκτρόνιο"}, 
            1, 
            "Περιέχει πυρήνα και ηλεκτρόνια"));
        hardQuestions.add(new Question(
            "Ποια είναι η γλώσσα προγραμματισμού που \nχρησιμοποιήθηκε για το πρώτο Unix;",
            new String[]{"C", "Java", "Assembly", "Fortran"},
            0, 
            "Δημιουργήθηκε από τον Dennis Ritchie"));
        hardQuestions.add(new Question(
            "Ποιος είναι ο συγγραφέας του έργου «Ο θάνατος του\nΙβάν Ίλιτς»;", 
            new String[]{"Ντοστογιέφσκι", "Γκόρκι", "Τολστόι", "Τσέχωφ"},
            2,
            "Έγραψε και την «Άννα Καρένινα»"));
        hardQuestions.add(new Question(
            "Τι είναι το “Schrödinger’s cat” στη φυσική;", 
            new String[]{"Νόμος", "Εξίσωση", "Παράδοξο", "Μονάδα"}, 
            2,
            "Γάτα ζωντανή & νεκρή ταυτόχρονα"));
        hardQuestions.add(new Question(
            "Ποιοι δύο θεοί έδωσαν το όνομά τους στις ημέρες \nTuesdayκαι Thursday στα αγγλικά;",
            new String[]{"Thor & Odin", "Mars & Jupiter", "Ares & Zeus", "Loki & Freya"},
            1, 
            "Ρωμαϊκοί θεοί πολέμου και κεραυνών"));
        hardQuestions.add(new Question(
            "Τι μονάδα μέτρησης είναι το Henry (Η);", 
            new String[]{"Αντίσταση", "Χωρητικότητα", "Επαγωγή", "Ρεύμα"}, 
            2,
            "Συνδέεται με τα πηνία"));
        hardQuestions.add(new Question(
            "Ποια χώρα χρησιμοποιεί το ρούβλι ως νόμισμα;", 
            new String[]{"Ουκρανία", "Λευκορωσία", "Ρωσία", "Καζακστάν"},
            2,
            "Συνορεύει με πολλές πρώην Σοβιετικές"));
        hardQuestions.add(new Question(
            "Ποιος είναι ο κύριος χαρακτήρας στο βιβλίο «1984» \nτου Τζορτζ Όργουελ;",
            new String[]{"Ουίνστον Σμιθ", "Τζούλια", "Μπιγκ Μπράδερ", "Ο'Μπράιαν"},
            0,
            "Εργάζεται στο Υπουργείο Αλήθειας"));
        hardQuestions.add(new Question(
            "Ποια από τις παρακάτω είναι πριμοδοτούμενη ουσία\nστο DNA;",
            new String[]{"Γουανίνη", "Κινολίνη", "Ισολευκίνη", "Τυροσίνη"},
            0,
            "Συνδυάζεται με κυτοσίνη"));
        hardQuestions.add(new Question(
            "Ποια ελληνική πόλη καταστράφηκε ολοκληρωτικά από \nτους Ρωμαίους το 146 π.Χ.;", 
            new String[]{"Δήλος", "Θήβα", "Κόρινθος", "Σπάρτη"},
            2,
            "Ήταν μεγάλη εμπορική πόλη"));
        hardQuestions.add(new Question(
            "Ποια είναι η βασική διαφορά μεταξύ ορθολογισμού \nκαι εμπειρισμού;", 
            new String[]{"Η προέλευση της γνώσης", "Η φύση της ύλης", "Η ύπαρξη Θεού", "Η σημασία της ηθικής"},
            0, 
            "Λογική vs εμπειρία"));
        hardQuestions.add(new Question(
            "Ποιος είναι ο δημιουργός του πίνακα «Η Γέννηση της\nΑφροδίτης»;", 
            new String[]{"Ντα Βίντσι", "Μποτιτσέλι", "Καραβάτζιο", "Ραφαήλ"}, 
            1,
            "Αναγεννησιακός, με έμφαση στη μυθολογία"));
        hardQuestions.add(new Question(
            "Ποιο χημικό στοιχείο είναι το πιο άφθονο στο\nσύμπαν;", 
            new String[]{"Ήλιο", "Οξυγόνο", "Υδρογόνο", "Άζωτο"}, 
            2,
            "Ένα πρωτόνιο, ένα ηλεκτρόνιο"));
        hardQuestions.add(new Question(
            "Ποιο ήταν το όνομα της αποστολής που μετέφερε \nτον πρώτο άνθρωπο στη Σελήνη;",
            new String[]{"Apollo 10", "Gemini 6", "Apollo 11", "Sputnik"},
            2, 
            "“Ένα μικρό βήμα…”"));
        hardQuestions.add(new Question(
            "Ποια θρησκεία πιστεύει στο Ντάρμα και τη Σαμσάρα;", 
            new String[]{"Ινδουισμός", "Βουδισμός", "Ισλάμ", "Ταοϊσμός"}, 
            0, 
            "Πολυθεϊστική και αρχ αιότερη από τον Βουδισμό"));
        hardQuestions.add(new Question(
            "Ποιος ήταν ο φυσικός που απέδειξε πειραματικά την \nύπαρξη των βαρυτικών κυμάτων;", 
            new String[]{"Χόκινγκ", "Κιπ Θορν", "Μάξγουελ", "Χάινριχ Χερτς"},
            1, "LIGO, Νομπέλ 2017"));
        hardQuestions.add(new Question(
            "Ποια χώρα έχει την πρωτεύουσα “Αστάνα”;", 
            new String[]{"Ουζμπεκιστάν", "Καζακστάν", "Γεωργία", "Μογγολία"},
            1,
            "Πρώην ΕΣΣΔ, στα ανατολικά"));
        hardQuestions.add(new Question(
            "Ποιο είναι το βασικό χαρακτηριστικό των φράκταλ;", 
            new String[]{"Χρωματισμός", "Περιοδικότητα", "Αυτοομοιότητα", "Συμμετρία"}, 
            2, 
            "Μοτίβα μέσα σε μοτίβα"));
        hardQuestions.add(new Question( 
            "Τι είναι το “Bauhaus”;",
            new String[]{"Μουσικό συγκρότημα", "Καλλιτεχνικό κίνημα", "Πολιτικό κόμμα", "Μουσείο"},
            1,
            "Σύνθεση τέχνης και αρχιτεκτονικής"));
        hardQuestions.add(new Question(
            "Ποια ελληνίδα επιστήμονας βραβεύτηκε με το \nBreakthrough Prize για την έρευνά της στον καρκίνο;", 
            new String[]{"Ελένη Αντωνιάδου", "Φωτεινή Νάσσου", "Μαρία Σπυροπούλου", "Μαρία Γκίκα"}, 
            1, 
            "2022, ερευνητικό κέντρο CRUK"));

    }

    public Question getRandomEasy() {
        return getRandomQuestion(easyQuestions);
    }

    public Question getRandomMedium() {
        return getRandomQuestion(mediumQuestions);
    }

    public Question getRandomHard() {
        return getRandomQuestion(hardQuestions);
    }

    private Question getRandomQuestion(List<Question> list) {
        if (list.isEmpty()) return null;
        int index = (int)(Math.random() * list.size());
        return list.remove(index); // για να μη ξαναεμφανιστεί
    }
}
